<?php
/*
//这里提出的问题均是与框架开发思想相关的。

1.CApplication继承了CModule，app中的所有模块也都继承CModule，这就是“模块化的应用架构”吗，为什么？（模块的深度讲解）


2.CWebApplication是最终的一个web类，它就是“框架对象”的代名词，以Yii::app()对象的方式存在，
它的作用就是整合资源并使之成为一个框架，那么CWebApplication自身的属性和方法有什么规则？（深度讲讲解app对象）


3.Yii如此快速是因为它广泛地使用lazy loading技术，具体体现在哪些方面，如何更好的使用它？
比如, 直到第一次使用到这个类，才会包含进来；直到对象第一次访问，才会创造这个对象。


4.框架具体是如何实现事件驱动编程模式，并写出不同类型的demo？


5.Active Record的 ORM设计模式，ORM是如何实现的？


6.如何理解yii中的命令行和基准测试？


7.I18N和L10N的标准化是如何实现的，相关的国际组织有哪些？


8.日志和异常在yii中的具体实现？





















 */